bazanski/espDash/firmware/esp32-gateway/src/main.cpp
// =========================================================================
// espDash CENTRAL CAN GATEWAY - 2014 Honda Civic 9th Gen
// =========================================================================
// SAFETY: the TWAI controller is installed in TWAI_MODE_LISTEN_ONLY and this
// firmware never transmits a CAN frame. Do not change that.
//
// CONCURRENCY
//   core 1  canRxTask   (prio 10) - twai_receive + decode + ring_push. No I/O.
//   core 1  publishTask (prio 5)  - ALL output: raw drain, JSON, ESP-NOW, and
//                                   Serial (+ WebSocket/telnet when enabled).
//   core 1  loopTask    (prio 1)  - Wi-Fi/OTA maintenance when enabled, else
//                                   just TWAI recovery checks.
//   core 0                        - left to the Wi-Fi/lwIP and TinyUSB tasks.
//
// Priority, not core affinity, is what protects CAN reception here: canRxTask
// preempts publishTask, so a blocking write cannot delay a frame.
//
// Output used to happen inside the TWAI receive loop, so a TCP retransmit or
// a slow USB host stalled CAN reception outright. At the measured 1399
// frames/s the driver's queue is only ~183 ms deep, so those stalls silently
// lost frames. The ring buffer decouples the two; overflow now drops the
// oldest frame and increments a counter reported as "dropped" in the JSON.
//
// WIRELESS: gated behind ESPDASH_GATEWAY_WIFI (platformio.ini), OFF by
// default. An on-car test showed the gateway's own Wi-Fi station -
// scanning/associating/roaming - degrading the ESP-NOW link to the display
// nodes even with power-save disabled and a runtime abandon-and-relock
// fallback in place. Rather than patch that further, the default build never
// attempts a Wi-Fi connection at all: no association, no scanning, no
// roaming, nothing for a fallback to abandon. USB serial + ESP-NOW only. The
// code for the old Wi-Fi-connected behavior (mDNS, ArduinoOTA, the WebSocket
// dashboard path, Telnet) is preserved behind the flag, not deleted - see
// ARCHITECTURE.md S5.1/S5.2 and set ESPDASH_GATEWAY_WIFI=1 to restore it.
//
// The WebSockets library is NOT thread-safe: when the flag is on,
// webSocket.loop() and broadcastTXT() must both stay inside publishTask.
// =========================================================================

#include <Arduino.h>
#include <WiFi.h>
#include <esp_wifi.h>
#include <esp_now.h>
#include "driver/twai.h"
#include "driver/gpio.h"
#include "esp_sleep.h"

#if ESPDASH_GATEWAY_WIFI
#include <WiFiMulti.h>
#include <ESPmDNS.h>
#include <ArduinoOTA.h>
#include <WebSocketsServer.h>
#endif

#include <EspDashProto.h>
#include <EspDashSignals.h>
#include "can_decode.h"

// =========================================================================
// CAN PINS (Waveshare ESP32-S3-RS485-CAN)
// =========================================================================
static const gpio_num_t CAN_TX_PIN = GPIO_NUM_15;
static const gpio_num_t CAN_RX_PIN = GPIO_NUM_16;
static bool twai_installed = false;

// =========================================================================
// POWER MANAGEMENT & SLEEP
// =========================================================================
// Automatic sleep on CAN bus inactivity (when the car is turned off):
//   - Tier 1: Light Sleep after 25s of silence (<1ms wake on CAN RX, no reboot)
//   - Tier 2: Deep Sleep after 30m of silence (~150ms boot on CAN RX, ~15uA core)
static volatile bool     power_save_auto = true;
static volatile uint32_t last_can_rx_ms = 0;
static volatile uint32_t total_sleep_cycles = 0;
static char              last_wakeup_reason[48] = "POWER_ON";
static TaskHandle_t      canRxTaskHandle = NULL;
static TaskHandle_t      publishTaskHandle = NULL;

static const uint32_t SLEEP_IDLE_TIMEOUT_MS  = 25000;    // 25s CAN silence -> sleep
static const uint32_t BOOT_GRACE_PERIOD_MS   = 30000;    // 30s after boot before sleep allowed
static const uint32_t DEEP_SLEEP_ESCALATE_S  = 30 * 60;  // 30 mins continuous idle -> Deep Sleep

// =========================================================================
// MODES
// =========================================================================
enum OperationalMode {
    MODE_TELEMETRY = 0,
    MODE_RAW_SNIFFER = 1,
    MODE_DUAL = 2
};

// Independent of current_mode: streaming raw CAN over ESP-NOW to an SD
// recorder node is orthogonal to what the USB/serial side is doing, so a
// capture can run while the dashboard is in any mode (or nothing is attached
// at all, which is the whole point - recording a drive without a laptop).
//
// Two independent sources can ask for streaming:
//   manual  - LOG:ON over serial, latched until LOG:OFF. For bench work.
//   node    - a recorder node repeatedly advertising that it wants data.
//             Expires on its own if the adverts stop, so an unplugged node
//             never leaves the gateway transmitting into the void.
// Effective state is the OR of the two.
static volatile bool     canlog_manual = false;
static volatile bool     canlog_node_req = false;
// Set by either stop path (serial LOG:OFF, or an explicit ESP-NOW stop
// command) and drained by publishTask - the sole owner of canlog_buf/
// canlog_count. Without this, a partial batch sitting in the buffer at the
// moment of stop was neither sent nor cleared: it sat frozen until the
// recorder was next armed, at which point canlog_flush_if_due()'s staleness
// check trivially fired (its timer had been sitting for arbitrary minutes)
// and shipped it as the FIRST packet of a completely different recording -
// tail frames from one drive appearing, mislabeled with an ancient
// timestamp, at the head of the next drive's file.
static volatile bool     canlog_flush_on_stop = false;
static volatile uint32_t canlog_node_req_ms = 0;

static inline bool canlog_active() {
    return canlog_manual || canlog_node_req;
}

static volatile OperationalMode current_mode = MODE_TELEMETRY;
static volatile bool demo_mode = false;
// Synthetic RAW-frame injector for bench-testing the SD recorder without a
// car. demo_mode only fakes the decoded snapshot, so it exercises none of the
// ring -> batch -> ESP-NOW -> SD path; two on-car bugs reached the vehicle
// because that path had never been driven on a desk. Payload carries a
// 32-bit sequence number so the host decoder can prove exact losslessness.
static volatile bool     logtest_mode = false;
static volatile uint32_t logtest_seq  = 0;
#if ESPDASH_GATEWAY_WIFI
static volatile bool ota_in_progress = false;
#endif

// =========================================================================
// SHARED STATE  (canRxTask writes, publishTask reads, guarded by spinlock)
// =========================================================================
static CanDecodeState g_state;                       // owned by canRxTask
static CanDecodeState g_snapshot;                    // published copy
static portMUX_TYPE state_mux = portMUX_INITIALIZER_UNLOCKED;

// =========================================================================
// RAW FRAME RING BUFFER  (canRxTask produces, publishTask consumes)
// =========================================================================
// 2048 slots (~34 KB). Sized for the canlog path: at the measured 1399
// frames/s this is ~1.4 s of buffer, enough to ride out radio backpressure
// when batches contend with the 20 Hz telemetry broadcast. The serial RAW
// path never needed this much, but the memory is cheap on an S3.
#define RAW_RING_SIZE 2048

