bazanski/espDash/firmware/esp32-gateway/src/main.cpp
#if ESPDASH_GATEWAY_WIFI
static void onWebSocketEvent(uint8_t num, WStype_t type, uint8_t *payload, size_t length) {
    if (type == WStype_TEXT) {
        String cmd = String((char *)payload, length);
        process_cmd_string(cmd);
    } else if (type == WStype_CONNECTED) {
        IPAddress ip = webSocket.remoteIP(num);
        Serial.printf("[WebSocket] Client #%u connected from %s\n", num, ip.toString().c_str());
    }
}
#endif

// =========================================================================
// TWAI
// =========================================================================
static bool install_twai() {
    if (twai_installed) {
        twai_stop();
        twai_driver_uninstall();
        twai_installed = false;
    }

    twai_general_config_t g = TWAI_GENERAL_CONFIG_DEFAULT(CAN_TX_PIN, CAN_RX_PIN, TWAI_MODE_LISTEN_ONLY);
    g.rx_queue_len = 512;  // ~366 ms at the measured 1399 frames/s

    twai_timing_config_t t = TWAI_TIMING_CONFIG_500KBITS();
    twai_filter_config_t f = TWAI_FILTER_CONFIG_ACCEPT_ALL();

    if (twai_driver_install(&g, &t, &f) != ESP_OK) return false;
    if (twai_start() != ESP_OK) return false;

    // Surface driver-level overruns instead of losing frames invisibly.
    twai_reconfigure_alerts(TWAI_ALERT_RX_QUEUE_FULL | TWAI_ALERT_BUS_OFF |
                            TWAI_ALERT_ERR_PASS, NULL);
    twai_installed = true;
    return true;
}

// =========================================================================
// CORE 1: CAN RX TASK - decode only, never blocks on I/O
// =========================================================================
static void canRxTask(void *arg) {
    (void)arg;
    twai_message_t rx;
    CanFrame f;

    for (;;) {
        if (!twai_installed) {
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }

        // Blocking receive with a short timeout: sleeps when the bus is quiet,
        // wakes immediately on a frame.
        if (twai_receive(&rx, pdMS_TO_TICKS(10)) != ESP_OK) continue;

        uint32_t now = millis();
        last_can_rx_ms = now;

        f.id  = rx.identifier;
        f.dlc = rx.data_length_code > 8 ? 8 : rx.data_length_code;
        memcpy(f.data, rx.data, f.dlc);

        can_decode_frame(&g_state, &f, now);

        // Publish a consistent copy for publishTask.
        portENTER_CRITICAL(&state_mux);
        g_snapshot = g_state;
        portEXIT_CRITICAL(&state_mux);

        // The raw ring feeds two independent consumers: the serial RAW text
        // stream (mode-gated) and the ESP-NOW SD recorder (NOT mode-gated -
        // see canlog_active()). Gating the producer on current_mode alone
        // silently starved the recorder in the default MODE_TELEMETRY: the
        // car decoded and drove the gauges perfectly while every recording
        // came back with 0 frames.
        if (current_mode == MODE_RAW_SNIFFER || current_mode == MODE_DUAL ||
            canlog_active()) {
            RawSlot s;
            s.ms  = now;
            s.id  = rx.identifier;
            s.rtr = rx.rtr;
            s.dlc = f.dlc;
            memcpy(s.data, f.data, 8);
            ring_push(&s);
        }
    }
}

// Pushes synthetic frames at ~1400 fps (the measured real bus rate) using a
// spread of genuine Honda IDs, so ID-table indexing and variable DLC are
// exercised too. Frame N carries seq=N big-endian in data[0..3]; the decoder
// then verifies received+dropped == sent with no gaps.
static void inject_test_frames(uint32_t now) {
    static const uint16_t ids[]  = {0x158,0x1D0,0x156,0x1A4,0x188,0x21E,0x17C,0x191,0x309,0x324};
    static const uint8_t  dlcs[] = {8,8,5,8,8,8,8,7,8,8};
    static uint32_t last = 0;
    if (last == 0) last = now;
    uint32_t elapsed = now - last;
    if (elapsed == 0) return;
    last = now;
    // 1400 fps, capped so a long scheduling gap can't dump a huge burst.
    uint32_t n = (elapsed * 1400) / 1000;
    if (n > 128) n = 128;
    for (uint32_t i = 0; i < n; i++) {
        uint32_t k = logtest_seq % (sizeof(ids)/sizeof(ids[0]));
        RawSlot s;
        s.ms  = now;
        s.id  = ids[k];
        s.rtr = 0;
        s.dlc = dlcs[k];
        memset(s.data, 0, 8);
        s.data[0] = (uint8_t)(logtest_seq >> 24);
        s.data[1] = (uint8_t)(logtest_seq >> 16);
        s.data[2] = (uint8_t)(logtest_seq >> 8);
        s.data[3] = (uint8_t)(logtest_seq);
        ring_push(&s);
        logtest_seq++;
    }
}

// =========================================================================
// CANLOG BATCHER - packs raw frames for the ESP-NOW SD recorder
// =========================================================================
// Called only from publishTask, so no locking is needed on the batch state.
//
// The ID table maps 11-bit CAN ids to a 1-byte index. This car has 45 unique
// ids, so a byte is ample; anything beyond the table (a new id appearing
// mid-drive) falls back to an escape marker plus the raw 16-bit id rather
// than being dropped - an unexpected id is exactly the kind of thing worth
// capturing.
#define CANLOG_ID_TABLE_MAX 64
#define CANLOG_BATCH_MAX_BYTES 240   // ESP-NOW hard limit is 250

static uint16_t canlog_id_table[CANLOG_ID_TABLE_MAX];
static uint8_t  canlog_id_count = 0;
static uint32_t last_canlog_ids_send = 0;
static uint32_t last_canlog_tx = 0;   // any canlog packet, for keepalive

static uint8_t  canlog_buf[CANLOG_BATCH_MAX_BYTES];
static uint16_t canlog_len = 0;       // bytes used in canlog_buf
static uint8_t  canlog_count = 0;     // frames packed
static uint32_t canlog_base_ms = 0;
static uint32_t canlog_first_push_ms = 0;

static uint8_t canlog_id_index(uint32_t id) {
    for (uint8_t i = 0; i < canlog_id_count; i++) {
        if (canlog_id_table[i] == (uint16_t)id) return i;
    }
    if (canlog_id_count < CANLOG_ID_TABLE_MAX) {
        canlog_id_table[canlog_id_count] = (uint16_t)id;
        return canlog_id_count++;
    }
    return ESPDASH_CANLOG_ID_ESCAPE;
}

// ESP-NOW hands packets to the Wi-Fi driver asynchronously and only a few TX
// buffers exist. With no send callback registered the gateway had no idea when
// one freed, so it simply fired as fast as publishTask produced batches and
// took ESP_ERR_ESPNOW_NO_MEM (12391) whenever it outran the radio - 91 lost
// batches in a 30 s bench run, ~1600 CAN frames, at a mere 60 packets/s and
// 14 KB/s. The problem was never bandwidth; it was that nothing tracked
// completion. Retrying blindly only papered over it (368 retries still left
// 91 failures).
//
// Now every ESP-NOW transmission waits for the previous one to complete before
// starting. That paces sends to whatever the radio can actually retire, which
// is self-tuning and needs no magic delay constant.
static volatile bool espnow_tx_busy = false;

static void onEspNowSent(const uint8_t *mac, esp_now_send_status_t status) {
    (void)mac; (void)status;
    espnow_tx_busy = false;    // runs in Wi-Fi task context: keep it trivial
}

// Waits for the in-flight packet to retire, then sends. Bounded so a lost
// completion callback can never wedge the gateway - it degrades to the old
// fire-and-forget behaviour rather than blocking telemetry forever.
static esp_err_t espnow_tx_paced(const uint8_t *pkt, size_t len) {
    int w = 0;
    while (w < 20 && espnow_tx_busy) { vTaskDelay(1); w++; }
    if (w >= 20) canlog_tx_waits++;   // gave up waiting: radio genuinely behind
    espnow_tx_busy = true;
    esp_err_t e = esp_now_send(broadcast_mac, pkt, len);
    if (e != ESP_OK) {
        espnow_tx_busy = false;
        // One retry after a yield covers the case where a buffer frees just
        // as we gave up waiting.
        if (e == ESP_ERR_ESPNOW_NO_MEM) {
            canlog_tx_retries++;
            vTaskDelay(2);
            espnow_tx_busy = true;
            e = esp_now_send(broadcast_mac, pkt, len);
            if (e != ESP_OK) espnow_tx_busy = false;
        }
    }
    if (e != ESP_OK) canlog_last_err = (int)e;
    return e;
}

static esp_err_t canlog_tx(const uint8_t *pkt, size_t len) {
    return espnow_tx_paced(pkt, len);
}

static bool canlog_send_batch() {
    if (canlog_count == 0) return true;

