bazanski/espDash/firmware/esp32-gateway/src/main.cpp
    uint8_t pkt[sizeof(EspDashHeader) + sizeof(EspDashCanLogHdr) + CANLOG_BATCH_MAX_BYTES];
    EspDashHeader *h = (EspDashHeader *)pkt;
    h->magic       = ESPDASH_MAGIC;
    h->msg_type    = ESPDASH_MSG_CANLOG;
    h->proto_major = ESPDASH_PROTO_MAJOR;
    h->proto_minor = ESPDASH_PROTO_MINOR;
    h->payload_len = (uint16_t)(sizeof(EspDashCanLogHdr) + canlog_len);
    h->seq         = canlog_seq++;

    EspDashCanLogHdr *ch = (EspDashCanLogHdr *)(pkt + sizeof(EspDashHeader));
    ch->base_ms    = canlog_base_ms;
    ch->count      = canlog_count;
    ch->flags      = 0;
    // Carry the gateway-side drop count so loss is recorded in the log file
    // itself. A lossy capture must be visible, never silent.
    ch->gw_dropped = (uint16_t)raw_dropped;

    memcpy(pkt + sizeof(EspDashHeader) + sizeof(EspDashCanLogHdr), canlog_buf, canlog_len);

    size_t total = sizeof(EspDashHeader) + sizeof(EspDashCanLogHdr) + canlog_len;
    if (canlog_tx(pkt, total) != ESP_OK) {
        // Hold the batch and retry on the next pass rather than discarding it.
        // These are captured CAN frames; a momentarily busy radio is no reason
        // to lose them. publishTask stops draining the ring while blocked, so
        // backpressure lands in the 2048-frame ring (~1.5 s at full bus rate)
        // and any genuine overflow is counted honestly by ring_dropped.
        canlog_send_fail++;
        canlog_tx_blocked = true;
        return false;
    }
    canlog_batches_sent++;
    canlog_frames_sent += canlog_count;
    last_canlog_tx = millis();
    canlog_tx_blocked = false;
    canlog_len = 0;
    canlog_count = 0;
    return true;
}

static bool canlog_add_frame(const RawSlot *s) {
    uint8_t dlc = s->dlc > 8 ? 8 : s->dlc;
    uint8_t idx = canlog_id_index(s->id);
    uint16_t need = 4 + dlc + (idx == ESPDASH_CANLOG_ID_ESCAPE ? 2 : 0);

    if (canlog_count == 0) {
        canlog_base_ms = s->ms;
        canlog_first_push_ms = millis();
    }
    // Flush before overflowing either the byte budget or the frame count.
    if (canlog_len + need > CANLOG_BATCH_MAX_BYTES ||
        canlog_count >= ESPDASH_CANLOG_MAX_FRAMES) {
        // Refuse the frame if the full batch could not go out - writing into a
        // held batch would overflow canlog_buf. The caller holds it instead.
        if (!canlog_send_batch()) return false;
        canlog_base_ms = s->ms;
        canlog_first_push_ms = millis();
    }

    uint32_t delta = s->ms - canlog_base_ms;
    if (delta > 0xFFFF) delta = 0xFFFF;   // clamp; batches span far less than 65 s

    uint8_t *p = canlog_buf + canlog_len;
    *p++ = idx;
    *p++ = dlc;
    *p++ = (uint8_t)(delta & 0xFF);
    *p++ = (uint8_t)(delta >> 8);
    if (idx == ESPDASH_CANLOG_ID_ESCAPE) {
        *p++ = (uint8_t)(s->id & 0xFF);
        *p++ = (uint8_t)((s->id >> 8) & 0xFF);
    }
    memcpy(p, s->data, dlc);
    canlog_len += need;
    canlog_count++;
    return true;
}

// Send the id table periodically so a recording that starts mid-stream is
// still decodable on its own.
static void canlog_send_ids(uint32_t now) {
    if (canlog_id_count == 0) return;
    uint8_t pkt[sizeof(EspDashHeader) + sizeof(EspDashCanLogIdsHdr) + CANLOG_ID_TABLE_MAX * 2];
    EspDashHeader *h = (EspDashHeader *)pkt;
    h->magic       = ESPDASH_MAGIC;
    h->msg_type    = ESPDASH_MSG_CANLOG_IDS;
    h->proto_major = ESPDASH_PROTO_MAJOR;
    h->proto_minor = ESPDASH_PROTO_MINOR;
    h->payload_len = (uint16_t)(sizeof(EspDashCanLogIdsHdr) + canlog_id_count * 2);
    // NOT canlog_seq: the node seq-checks only CANLOG batches/keepalives
    h->seq         = espnow_seq++;

    EspDashCanLogIdsHdr *ih = (EspDashCanLogIdsHdr *)(pkt + sizeof(EspDashHeader));
    ih->count = canlog_id_count;
    ih->reserved = 0;
    uint8_t *ids = pkt + sizeof(EspDashHeader) + sizeof(EspDashCanLogIdsHdr);
    for (uint8_t i = 0; i < canlog_id_count; i++) {
        ids[i*2]     = (uint8_t)(canlog_id_table[i] & 0xFF);
        ids[i*2 + 1] = (uint8_t)(canlog_id_table[i] >> 8);
    }
    espnow_tx_paced(pkt,
                    sizeof(EspDashHeader) + sizeof(EspDashCanLogIdsHdr) + canlog_id_count * 2);
    last_canlog_ids_send = now;
}

// Flush a partial batch that has been sitting too long (quiet bus), and
// refresh the id table every 2 s.
// Empty batch used purely as a liveness signal. The node cannot otherwise
// tell "gateway is gone" from "gateway is fine but the CAN bus is quiet",
// and it times out after 8 s either way.
//
// The id-table message was originally meant to serve as this heartbeat, but
// it only sends when canlog_id_count > 0 - and that table is populated FROM
// CAN frames. With the ignition off there are no frames, so the table stays
// empty, nothing is transmitted at all, and the node gives up. That made it
// impossible to arm a recording before turning the key, which is exactly
// when the ignition-sequence data worth capturing appears.
static void canlog_send_keepalive() {
    uint8_t pkt[sizeof(EspDashHeader) + sizeof(EspDashCanLogHdr)];
    EspDashHeader *h = (EspDashHeader *)pkt;
    h->magic       = ESPDASH_MAGIC;
    h->msg_type    = ESPDASH_MSG_CANLOG;
    h->proto_major = ESPDASH_PROTO_MAJOR;
    h->proto_minor = ESPDASH_PROTO_MINOR;
    h->payload_len = sizeof(EspDashCanLogHdr);
    h->seq         = canlog_seq++;

    EspDashCanLogHdr *ch = (EspDashCanLogHdr *)(pkt + sizeof(EspDashHeader));
    ch->base_ms    = millis();
    ch->count      = 0;              // decoder handles this as a no-op batch
    ch->flags      = 0;
    ch->gw_dropped = (uint16_t)raw_dropped;

    if (canlog_tx(pkt, sizeof(pkt)) == ESP_OK) {
        last_canlog_tx = millis();
    } else {
        canlog_send_fail++;
    }
}

static void canlog_flush_if_due(uint32_t now) {
    if (canlog_count > 0 && (now - canlog_first_push_ms) >= 20) {
        canlog_send_batch();
    }
    if (canlog_id_count > 0 && now - last_canlog_ids_send >= 2000) {
        canlog_send_ids(now);
    }
    // Keep the link demonstrably alive on a silent bus.
    if (now - last_canlog_tx >= 1000) {
        canlog_send_keepalive();
    }
}

// =========================================================================
// CORE 0: PUBLISH TASK - owns every byte of output
// =========================================================================

// Dynamic signals must not sit frozen when the bus goes quiet: showing 5000
// rpm on a switched-off car is worse than showing zero. Slow-moving signals
// (coolant, fuel consumption, battery, ambient, gear) legitimately persist
// and are left at their last known value.
static void apply_staleness(CanDecodeState *s, uint32_t now) {
    const uint32_t T = 2000;
    if (can_decode_is_stale(s, SIG_RPM, now, T))      s->rpm = 0;
    if (can_decode_is_stale(s, SIG_SPEED, now, T))    s->speed_kmh_x10 = 0;
    if (can_decode_is_stale(s, SIG_WHEELS, now, T)) {
        s->wheel_fl_x10 = s->wheel_fr_x10 = s->wheel_rl_x10 = s->wheel_rr_x10 = 0;
    }
    if (can_decode_is_stale(s, SIG_THROTTLE, now, T)) s->throttle_pct = 0;
    if (can_decode_is_stale(s, SIG_BRAKE, now, T))    s->brake_pct = 0;
    if (can_decode_is_stale(s, SIG_STEER, now, T))    s->steering_deg = 0;
}

static void publishTask(void *arg) {
    (void)arg;
    uint32_t last_json = 0, last_espnow = 0;
    float sim_t = 0.0f;
    char raw_buf[128];
    char json_buf[512];

