bazanski/espDash/firmware/esp32-gateway/src/main.cpp
    for (;;) {
        uint32_t now = millis();

        // ---- 1. Serial commands -----------------------------------------
        while (Serial.available()) {
            process_cmd_string(Serial.readStringUntil('\n'));
        }

#if ESPDASH_GATEWAY_WIFI
        // ---- 2. Network servicing (all WebSocket calls live here) --------
        if (WiFi.status() == WL_CONNECTED) {
            webSocket.loop();

            if (telnetServer.hasClient()) {
                WiFiClient nc = telnetServer.available();
                if (telnetClient && telnetClient.connected()) telnetClient.stop();
                telnetClient = nc;
            }
            if (telnetClient && telnetClient.connected() && telnetClient.available()) {
                process_cmd_string(telnetClient.readStringUntil('\n'));
            }
        }

        // Suspend streaming during OTA so the flash has the radio to itself.
        if (ota_in_progress) {
            vTaskDelay(pdMS_TO_TICKS(20));
            continue;
        }
#endif

        // ---- 3. Drain the raw ring --------------------------------------
        // Budget per pass keeps JSON/ESP-NOW cadence from being starved by a
        // burst; 64 frames/ms is ~45x the measured mean rate.
        //
        // Each popped frame goes to whichever sinks are active: the serial
        // RAW text stream (when in RAW/DUAL mode) and/or the ESP-NOW canlog
        // batcher. A frame is popped exactly once and fanned out, so enabling
        // the recorder never steals frames from a USB capture running at the
        // same time.
        if (logtest_mode && canlog_active()) inject_test_frames(now);

        // A frame already popped and already echoed to the serial RAW stream,
        // which the batcher could not accept because a previous batch is still
        // waiting to go out. Retried before anything new is drained so ordering
        // is preserved; only the canlog side is retried, since the serial side
        // already emitted it.
        static RawSlot held;
        static bool    has_held = false;
        if (has_held) {
            if (canlog_add_frame(&held)) has_held = false;
        }

        int budget = 64;
        RawSlot s;
        bool serial_raw = (current_mode == MODE_RAW_SNIFFER || current_mode == MODE_DUAL);
        while (!has_held && budget-- > 0 && ring_pop(&s)) {
            if (serial_raw) {
                int p = snprintf(raw_buf, sizeof(raw_buf), "RAW,%lu,0x%03X,%u,%u",
                                 (unsigned long)s.ms, (unsigned int)s.id, s.rtr, s.dlc);
                for (int i = 0; i < s.dlc && i < 8; i++) {
                    p += snprintf(raw_buf + p, sizeof(raw_buf) - p, ",%02X", s.data[i]);
                }
                snprintf(raw_buf + p, sizeof(raw_buf) - p, "\n");
                broadcast_line(raw_buf);
            }
            if (canlog_active()) {
                if (!canlog_add_frame(&s)) { held = s; has_held = true; }
            }
        }
        // Flush a partial batch if it has been waiting too long, so the tail
        // of a capture is never stranded when the bus goes quiet.
        // Expire a node request that has stopped arriving: the recorder was
        // switched off, unplugged, or drove out of range. Without this the
        // gateway would keep transmitting into the void.
        if (canlog_node_req && (now - canlog_node_req_ms) > ESPDASH_NODE_CMD_TIMEOUT_MS) {
            canlog_node_req = false;
            canlog_send_batch();   // don't strand a partial batch
        }

        // Send the ID table the instant the recorder is armed, not on the
        // next 2 s tick. Without this the first 1-2 s of every recording has
        // no table to resolve against; the decoder can patch that up
        // retroactively, but only if a later table exists in the file - a
        // capture power-cut inside its first 2 s would be undecodable.
        {
            static bool prev_active = false;
            bool active = canlog_active();
            if (active && !prev_active) last_canlog_ids_send = 0;
            prev_active = active;
        }
        if (canlog_active()) {
            canlog_flush_if_due(now);
        } else if (canlog_flush_on_stop) {
            // Runs exactly once per stop, after the last add_frame() for this
            // session (add_frame is gated on canlog_active(), already false).
            canlog_flush_on_stop = false;
            canlog_send_batch();
        }

        // ---- 4. Snapshot -------------------------------------------------
        CanDecodeState snap;
        portENTER_CRITICAL(&state_mux);
        snap = g_snapshot;
        portEXIT_CRITICAL(&state_mux);

        if (demo_mode) {
            sim_t += 0.05f;
            apply_demo(&snap, sim_t);
        } else {
            apply_staleness(&snap, now);
        }

        // ---- 5. ESP-NOW @20Hz -------------------------------------------
        if (now - last_espnow >= 50) {
            last_espnow = now;

            uint8_t pkt[ESPDASH_PACKET_SIZE];
            EspDashHeader *h = (EspDashHeader *)pkt;
            h->magic       = ESPDASH_MAGIC;
            h->msg_type    = ESPDASH_MSG_TELEMETRY;
            h->proto_major = ESPDASH_PROTO_MAJOR;
            h->proto_minor = ESPDASH_PROTO_MINOR;
            h->payload_len = sizeof(EspDashTelemetry);
            h->seq         = espnow_seq++;

            EspDashTelemetry *t = (EspDashTelemetry *)(pkt + sizeof(EspDashHeader));
            t->rpm             = snap.rpm;
            t->speed_kmh_x10   = snap.speed_kmh_x10;
            t->water_temp_x10  = snap.water_temp_x10;
            t->oil_temp_x10    = snap.oil_temp_x10;
            t->battery_mv      = snap.battery_mv;
            t->gear            = (snap.gear == 0xFF) ? 0 : snap.gear;
            t->fuel_consumption_x10 = snap.fuel_consumption_x10;
            t->steering_deg    = snap.steering_deg;
            t->ambient_temp    = snap.ambient_temp;
            t->flags           = can_decode_flags(&snap);
            t->throttle_pct    = snap.throttle_pct;
            t->brake_pct       = snap.brake_pct;
            t->timestamp_ms    = now;
            t->wheel_fl_x10    = snap.wheel_fl_x10;
            t->wheel_fr_x10    = snap.wheel_fr_x10;
            t->wheel_rl_x10    = snap.wheel_rl_x10;
            t->wheel_rr_x10    = snap.wheel_rr_x10;
            t->fuel_level_pct  = snap.fuel_level_pct;
            t->gear_num        = snap.gear_num;
            t->odo_50m         = snap.odo_50m;
            t->cabin_temp      = snap.cabin_temp;
            t->fan_speed       = snap.fan_speed;
            t->lights          = snap.lights;
            t->flags2 = (uint8_t)(
                (snap.low_fuel         ? ESPDASH_FLAG2_LOW_FUEL   : 0) |
                (snap.econ_on          ? ESPDASH_FLAG2_ECON       : 0) |
                (snap.sport_mode       ? ESPDASH_FLAG2_SPORT      : 0) |
                (snap.turn_left        ? ESPDASH_FLAG2_TURN_LEFT  : 0) |
                (snap.turn_right       ? ESPDASH_FLAG2_TURN_RIGHT : 0) |
                (snap.fuel_level_valid ? ESPDASH_FLAG2_FUEL_VALID : 0) |
                (snap.odo_valid        ? ESPDASH_FLAG2_ODO_VALID  : 0));

            // Keep the last body so the SIGNALS command can print live values
            // next to the catalog. Written only here, on publishTask.
            memcpy(&last_wire_telemetry, t, sizeof(last_wire_telemetry));

            // peer.channel = 0 makes ESP-NOW follow the station's current
            // channel. With ESPDASH_GATEWAY_WIFI=0 (the default) that channel
            // is fixed at boot and never changes, so this essentially cannot
            // fail for channel reasons. With the flag on, a connection lost
            // mid-run leaves the channel transiently undefined - the failure
            // mode the loop() fallback exists to recover from - and this
            // counter is what makes that failure visible instead of silent.
            // Paced like the log path: telemetry sharing the radio
            // un-paced would keep stealing the TX buffers the recorder
            // needs, which is half of why the recorder saw NO_MEM.
            if (espnow_tx_paced(pkt, sizeof(pkt)) != ESP_OK) {
                espnow_send_fail++;
            }
        }

        // ---- 6. JSON telemetry @10Hz ------------------------------------
        // Key names and units are frozen: the web dashboard, log_collector.py
        // and tests/test_log_collector.py all bind to this exact schema.
        if ((current_mode == MODE_TELEMETRY || current_mode == MODE_DUAL) &&
            (now - last_json >= 100)) {
            last_json = now;

            uint8_t flags = can_decode_flags(&snap);
            snprintf(json_buf, sizeof(json_buf),
                "{\"type\":\"telemetry\",\"mac\":\"%s\",\"rpm\":%u,\"speed\":%.1f,"
                "\"water_temp\":%.1f,\"oil_temp\":%.1f,\"battery_v\":%.2f,\"gear\":%u,"
                "\"fuel_consumption_x10\":%u,\"throttle\":%u,\"steering\":%d,\"brake\":%u,\"abs\":%s,"
                "\"tc\":%s,\"brake_sw\":%s,\"cel\":%s,\"vsa_warn\":%s,\"w_fl\":%.1f,"
                "\"w_fr\":%.1f,\"w_rl\":%.1f,\"w_rr\":%.1f,\"ambient\":%d,"
                "\"fuel_level\":%d,\"low_fuel\":%s,\"gear_num\":%u,"
                "\"econ\":%s,\"sport\":%s,\"turn_l\":%s,\"turn_r\":%s,"
                "\"odo_50m\":%d,\"cabin_temp\":%d,\"fan_speed\":%u,\"lights\":%u,"
                "\"dropped\":%lu,\"timestamp\":%lu}\n",
                WiFi.macAddress().c_str(),
                snap.rpm,
                snap.speed_kmh_x10 / 10.0f,
                snap.water_temp_x10 / 10.0f,
                snap.oil_temp_x10 / 10.0f,
                snap.battery_mv / 1000.0f,
                (snap.gear == 0xFF) ? 0 : snap.gear,
                snap.fuel_consumption_x10,
                snap.throttle_pct,
                snap.steering_deg,
                snap.brake_pct,
                (flags & ESPDASH_FLAG_ABS_ACTIVE)   ? "true" : "false",
                (flags & ESPDASH_FLAG_TC_ACTIVE)    ? "true" : "false",
                (flags & ESPDASH_FLAG_BRAKE_SWITCH) ? "true" : "false",
                (flags & ESPDASH_FLAG_CEL)          ? "true" : "false",
                (flags & ESPDASH_FLAG_VSA_WARNING)  ? "true" : "false",
                snap.wheel_fl_x10 / 10.0f,
                snap.wheel_fr_x10 / 10.0f,
                snap.wheel_rl_x10 / 10.0f,
                snap.wheel_rr_x10 / 10.0f,
                snap.ambient_temp,
                // -1 rather than 0 when unknown: 0% is a real reading a driver
                // must be able to trust, so it cannot double as "no data".
                snap.fuel_level_valid ? (int)snap.fuel_level_pct : -1,
                snap.low_fuel   ? "true" : "false",
                snap.gear_num,
                snap.econ_on    ? "true" : "false",
                snap.sport_mode ? "true" : "false",
                snap.turn_left  ? "true" : "false",
                snap.turn_right ? "true" : "false",
                snap.odo_valid ? (int)snap.odo_50m : -1,
                snap.cabin_temp,
                snap.fan_speed,
                snap.lights,
                (unsigned long)raw_dropped,
                (unsigned long)now);
            broadcast_line(json_buf);
        }

        vTaskDelay(1);  // 1 tick; yields the core to Wi-Fi between passes
    }
}

// =========================================================================
// ESP-NOW
// =========================================================================
// Upstream messages from recorder nodes. Runs in the Wi-Fi task context, so
// it only touches a couple of volatiles and returns - no logging, no I/O.
#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR >= 5
static void onEspNowRecv(const esp_now_recv_info_t *info, const uint8_t *data, int len) {
#else
static void onEspNowRecv(const uint8_t *mac, const uint8_t *data, int len) {
#endif
    espnow_rx_any++;
    const EspDashNodeCmd *cmd = espdash_parse_nodecmd(data, len);
    if (!cmd) return;
    espnow_rx_cmd++;

    if (cmd->want_canlog) {
        canlog_node_req = true;
        canlog_node_req_ms = millis();
    } else {
        // An explicit "stop" takes effect immediately rather than waiting
        // for the timeout, so releasing the button feels instant.
        canlog_node_req = false;
        canlog_flush_on_stop = true;
    }
}

// =========================================================================
// POWER MANAGEMENT: ENTER SLEEP
// =========================================================================
static void init_esp_now();

static void enter_gateway_sleep() {
    uint32_t idle = (last_can_rx_ms > 0 && millis() >= last_can_rx_ms) ? (millis() - last_can_rx_ms) : 0;
    Serial.printf("[POWER] CAN bus silent for %lu ms (threshold %lu ms). Preparing sleep...\n",
                  (unsigned long)idle, (unsigned long)SLEEP_IDLE_TIMEOUT_MS);
    Serial.flush();

    // 1. Drain/flush any active logging so partial buffers aren't stranded
    if (canlog_active()) {
        canlog_send_batch();
    }

    // 2. Suspend worker tasks so they don't access TWAI / Wi-Fi while shut down
    if (canRxTaskHandle) vTaskSuspend(canRxTaskHandle);
    if (publishTaskHandle) vTaskSuspend(publishTaskHandle);

