bazanski/espDash/firmware/esp32-gateway/src/main.cpp
    // 3. Stop and uninstall TWAI driver
    if (twai_installed) {
        twai_stop();
        twai_driver_uninstall();
        twai_installed = false;
        Serial.println("[POWER] TWAI driver uninstalled.");
    }

    // 4. Stop ESP-NOW and Wi-Fi radio
    esp_now_deinit();
    WiFi.disconnect(true, true);
    Serial.println("[POWER] Wi-Fi & ESP-NOW radios powered down.");

    // 5. Configure CAN_RX (GPIO 16) for wake-up.
    // In CAN recessive state, transceiver pulls RX HIGH.
    // When a frame arrives (dominant SOF bit), transceiver pulls RX LOW.
    gpio_reset_pin(CAN_RX_PIN);
    gpio_set_direction(CAN_RX_PIN, GPIO_MODE_INPUT);
    gpio_pullup_en(CAN_RX_PIN);
    gpio_wakeup_enable(CAN_RX_PIN, GPIO_INTR_LOW_LEVEL);
    esp_sleep_enable_gpio_wakeup();

    // 6. Enable 10-minute timer wakeup so we can track prolonged parking for Deep Sleep
    const uint64_t WAKEUP_TIMER_US = 10ULL * 60ULL * 1000000ULL; // 10 minutes
    esp_sleep_enable_timer_wakeup(WAKEUP_TIMER_US);

    total_sleep_cycles++;
    uint32_t sleep_start = millis();
    uint32_t accumulated_sleep_sec = 0;

    Serial.println("[POWER] Entering Light Sleep. Wakes instantly (<1ms) on CAN_RX (GPIO16 LOW)...");
    Serial.flush();

    while (true) {
        esp_light_sleep_start();

        esp_sleep_wakeup_cause_t cause = esp_sleep_get_wakeup_cause();
        if (cause == ESP_SLEEP_WAKEUP_GPIO) {
            snprintf(last_wakeup_reason, sizeof(last_wakeup_reason), "GPIO_CAN_RX (Light Sleep)");
            break; // CAN bus activity detected!
        } else if (cause == ESP_SLEEP_WAKEUP_TIMER) {
            accumulated_sleep_sec += 10 * 60;
            if (accumulated_sleep_sec >= DEEP_SLEEP_ESCALATE_S) {
                // Car has been parked continuously for >= 30 minutes.
                // Escalate to Deep Sleep (shuts down CPU core completely to ~15uA).
                Serial.println("[POWER] Parked >30m. Escalating to Deep Sleep (RTC EXT0 on GPIO16)...");
                Serial.flush();
                esp_sleep_enable_ext0_wakeup(CAN_RX_PIN, 0); // Wake on GPIO16 LOW
                esp_deep_sleep_start();
                // Never returns: ESP32-S3 reboots on wake
            }
            // Re-arm wakeups and go back to sleep
            esp_sleep_enable_gpio_wakeup();
            esp_sleep_enable_timer_wakeup(WAKEUP_TIMER_US);
        } else {
            snprintf(last_wakeup_reason, sizeof(last_wakeup_reason), "OTHER (%d)", (int)cause);
            break;
        }
    }

    // --- WAKE UP & RESTORATION ---
    gpio_wakeup_disable(CAN_RX_PIN);

    // 7. Restart Wi-Fi into STA mode and reinitialize ESP-NOW
    WiFi.disconnect(true, true);
    WiFi.mode(WIFI_STA);
    esp_wifi_set_channel(ESPDASH_ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
    esp_wifi_set_ps(WIFI_PS_NONE);
    init_esp_now();

    // 8. Reinstall TWAI driver
    if (install_twai()) {
        Serial.println("[POWER] TWAI driver reinstalled.");
    } else {
        Serial.println("[POWER] TWAI reinstall FAILED!");
    }

    // 9. Reset CAN activity timestamp
    last_can_rx_ms = millis();

    // 10. Resume worker tasks
    if (canRxTaskHandle) vTaskResume(canRxTaskHandle);
    if (publishTaskHandle) vTaskResume(publishTaskHandle);

    Serial.printf("[POWER] Resumed! Slept %lu ms. Worker tasks active.\n",
                  (unsigned long)(millis() - sleep_start));
}

static void init_esp_now() {
    if (esp_now_init() != ESP_OK) {
        Serial.println("[ESP-NOW] Initialization failed!");
        return;
    }
    esp_now_register_recv_cb(onEspNowRecv);
    esp_now_register_send_cb(onEspNowSent);
    esp_now_peer_info_t peer = {};
    memcpy(peer.peer_addr, broadcast_mac, 6);
    peer.channel = 0;   // follow the station channel
    peer.encrypt = false;
    if (esp_now_add_peer(&peer) != ESP_OK) {
        Serial.println("[ESP-NOW] Failed to add broadcast peer!");
    } else {
        Serial.println("[ESP-NOW] Multicast peer active (FF:FF:FF:FF:FF:FF)");
    }
}

// =========================================================================
// SETUP
// =========================================================================
void setup() {
    Serial.begin(115200);
    delay(500);

    // Check if we booted from Deep Sleep via CAN RX activity
    esp_sleep_wakeup_cause_t boot_cause = esp_sleep_get_wakeup_cause();
    if (boot_cause == ESP_SLEEP_WAKEUP_EXT0) {
        snprintf(last_wakeup_reason, sizeof(last_wakeup_reason), "EXT0_CAN_RX (Deep Sleep)");
        Serial.println("[POWER] Booting from Deep Sleep via CAN RX activity (EXT0 on GPIO16)!");
    } else {
        snprintf(last_wakeup_reason, sizeof(last_wakeup_reason), "POWER_ON / RESET");
    }
    last_can_rx_ms = millis();

    can_decode_init(&g_state);
    can_decode_init(&g_snapshot);

    Serial.println("\n=================================================================");
    Serial.println(" espDash CENTRAL CAN GATEWAY (2014 HONDA CIVIC 9TH GEN)");
    Serial.println(" BAUD  : 500 kbps (TWAI_MODE_LISTEN_ONLY - never transmits)");
    Serial.printf(" PROTO : ESP-NOW v%d.%d, %u byte packet\n",
                  ESPDASH_PROTO_MAJOR, ESPDASH_PROTO_MINOR, (unsigned)ESPDASH_PACKET_SIZE);
    Serial.println("=================================================================");

    if (install_twai()) {
        Serial.println("[TWAI] Installed on GPIO15(TX)/GPIO16(RX), rx_queue_len=512");
    } else {
        Serial.println("[TWAI] INSTALL FAILED");
    }

#if ESPDASH_GATEWAY_WIFI
    wifiMulti.addAP("Comlex_parking", "12345678");
    wifiMulti.addAP("Complex_parking", "12345678");
    wifiMulti.addAP("Bazanski_ph", "52288488");
    wifiMulti.addAP("Bazanski_IS", "52288488");
    wifiMulti.addAP("IOT-monday", "fsdL2Dp*KBU0y#9F&c!Zbq853axj");

    WiFi.mode(WIFI_AP_STA);

    Serial.println("[Wi-Fi] Connecting (max 15s)...");
    uint32_t t0 = millis();
    bool connected = false;
    while (millis() - t0 < 15000) {
        if (wifiMulti.run() == WL_CONNECTED) { connected = true; break; }
        delay(150);
    }

    if (connected) {
        WiFi.setAutoReconnect(true);
        Serial.printf("[Wi-Fi SUCCESS] IP: %s (SSID: %s, MAC: %s, mDNS: esp32-gateway.local)\n",
                      WiFi.localIP().toString().c_str(), WiFi.SSID().c_str(),
                      WiFi.macAddress().c_str());
        if (MDNS.begin("esp32-gateway")) {
            MDNS.addService("espdash", "tcp", 8889);
            MDNS.addServiceTxt("espdash", "tcp", "mac", WiFi.macAddress());
            MDNS.addServiceTxt("espdash", "tcp", "device", "gateway");
        }
        ArduinoOTA.onStart([]() { ota_in_progress = true; });
        ArduinoOTA.onEnd([]() { ota_in_progress = false; });
        ArduinoOTA.onError([](ota_error_t) { ota_in_progress = false; });
        ArduinoOTA.begin();
        webSocket.begin();
        webSocket.onEvent(onWebSocketEvent);
        telnetServer.begin();
        telnetServer.setNoDelay(true);
    } else {
        Serial.println("[Wi-Fi TIMEOUT] Not connected. Locking to fixed channel for ESP-NOW.");
        WiFi.disconnect(true, true);
        WiFi.mode(WIFI_STA);
        esp_wifi_set_channel(ESPDASH_ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
    }
#else
    // No Wi-Fi station is ever attempted: no association, no scanning, no
    // roaming, and therefore nothing for a runtime fallback to abandon. This
    // is what actually fixed the on-car ESP-NOW instability - see the banner
    // comment at the top of this file. Set ESPDASH_GATEWAY_WIFI=1 in
    // platformio.ini and rebuild to restore mDNS/OTA/WebSocket/Telnet.
    Serial.println("[Wi-Fi] Disabled at build time (ESPDASH_GATEWAY_WIFI=0). USB + ESP-NOW only.");
    // Order matters: disconnect(true, true)'s second argument stops the Wi-Fi
    // radio outright (esp_wifi_stop()). WiFi.mode(WIFI_STA) must come AFTER
    // it, since that's what restarts the radio into STA mode - reversing
    // this order leaves the interface down and esp_now_send() failing with
    // ESP_ERR_ESPNOW_IF on every call, which is exactly what happened here
    // the first time this was written with the calls the other way round.
    WiFi.disconnect(true, true);
    WiFi.mode(WIFI_STA);
    esp_wifi_set_channel(ESPDASH_ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
#endif

