bazanski/espDash/firmware/esp32-gateway/src/main.cpp
    // Wi-Fi STA modem sleep makes the radio doze between DTIM beacons, which
    // costs ESP-NOW packets on both ends of the link. The gateway is mains/
    // vehicle powered, so trade the power for a dependable 20 Hz.
    esp_wifi_set_ps(WIFI_PS_NONE);

    init_esp_now();

    // Both application tasks live on core 1; core 0 is left to the Wi-Fi/lwIP
    // stack AND the TinyUSB device task, which is what actually drains the USB
    // CDC FIFO. Running publishTask on core 0 starves that task and silently
    // drops CDC bytes - measured as ~10% byte loss shredding 58% of telemetry
    // lines into fragments, against 0 fragments with both tasks on core 1.
    //
    // Nothing is lost by this placement: canRxTask at priority 10 preempts
    // publishTask at 5, so a blocking write still cannot delay CAN reception,
    // which is the entire point of the split.
    xTaskCreatePinnedToCore(canRxTask,   "canRx",   4096, NULL, 10, &canRxTaskHandle, 1);
    xTaskCreatePinnedToCore(publishTask, "publish", 8192, NULL, 5,  &publishTaskHandle, 1);

    Serial.println("[SYSTEM] Gateway ready. canRxTask@core1 prio10, publishTask@core1 prio5.");
}

// =========================================================================
// LOOP (core 1, prio 1) - Wi-Fi/OTA maintenance when enabled, TWAI recovery
// always
// =========================================================================
void loop() {
    static uint32_t last_diag = 0;
    uint32_t now = millis();

#if ESPDASH_GATEWAY_WIFI
    static uint32_t last_wifi_check = 0;
    static uint32_t wifi_lost_since = 0;

    if (WiFi.status() == WL_CONNECTED) {
        ArduinoOTA.handle();
    }

    if (now - last_wifi_check >= 5000) {
        last_wifi_check = now;
        if (WiFi.status() == WL_CONNECTED) {
            wifi_lost_since = 0;
            String ip = WiFi.localIP().toString();
            if (ip != last_connected_ip) {
                last_connected_ip = ip;
                Serial.printf("[Wi-Fi] Connected IP: %s (SSID: %s)\n",
                              ip.c_str(), WiFi.SSID().c_str());
            }
        } else {
            last_connected_ip = "";

            // Wi-Fi that connected at boot and later drops (car drives out of
            // AP range) is NOT the same case as "no AP found within 15s at
            // boot" - only the latter was ever handled, by locking to a fixed
            // channel once in setup(). At runtime, WiFi.setAutoReconnect(true)
            // instead leaves the radio scanning/roaming indefinitely, which
            // means the ESP-NOW peer's channel=0 ("follow the station") is
            // tracking a channel that keeps moving or is transiently
            // undefined mid-reconnect. esp_now_send() can then fail silently
            // - nothing checked its return value before espnow_send_fail was
            // added - and the display node's own channel sweep has no fixed
            // target to lock onto, so it searches indefinitely. A full
            // gateway reboot "fixes" it only because it re-runs the boot-time
            // timeout path and lands back on a stable, fixed channel.
            //
            // This mitigation is what ESPDASH_GATEWAY_WIFI=0 (the default)
            // supersedes: with no Wi-Fi ever attempted, there's nothing to
            // lose and nothing to abandon. Kept here, gated, for when Wi-Fi
            // is deliberately re-enabled.
            if (!wifi_fallback_engaged) {
                if (wifi_lost_since == 0) {
                    wifi_lost_since = now;
                } else if (now - wifi_lost_since >= 20000) {
                    wifi_fallback_engaged = true;
                    Serial.println("[Wi-Fi] Lost for 20s - abandoning reconnect, "
                                   "locking ESP-NOW to a fixed channel for stability");
                    WiFi.setAutoReconnect(false);
                    WiFi.disconnect(true, true);
                    WiFi.mode(WIFI_STA);
                    esp_wifi_set_channel(ESPDASH_ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
                }
            }
        }
    }
#endif

    if (now - last_diag >= 5000) {
        last_diag = now;

        uint32_t alerts = 0;
        if (twai_read_alerts(&alerts, 0) == ESP_OK) {
            if (alerts & TWAI_ALERT_RX_QUEUE_FULL) twai_queue_full_events++;
        }

        twai_status_info_t st;
        if (twai_get_status_info(&st) == ESP_OK) {
            if (st.state == TWAI_STATE_BUS_OFF)      twai_initiate_recovery();
            else if (st.state == TWAI_STATE_STOPPED) twai_start();
        }
    }

    // Power management check:
    // If auto power-save is active and the CAN bus has been completely silent
    // for at least SLEEP_IDLE_TIMEOUT_MS, enter low-power sleep.
    bool can_sleep = power_save_auto && !demo_mode && !logtest_mode && !canlog_manual;
#if ESPDASH_GATEWAY_WIFI
    can_sleep = can_sleep && !ota_in_progress;
#endif
    if (can_sleep && (now > BOOT_GRACE_PERIOD_MS) && ((now - last_can_rx_ms) >= SLEEP_IDLE_TIMEOUT_MS)) {
        enter_gateway_sleep();
        now = millis();
        last_diag = now;
    }

    vTaskDelay(pdMS_TO_TICKS(10));
}
